/*--створити масив з:
    - з 5 числових значень*/

let arr_number = [1, 2, 3, 4, 5];

/*- з 5 стічкових значень*/

let arr_string = [`hi`, `hi`, `hello`, `hhhh`, `eee`];

/*- з 5 значень стрічкового, числового та булевого типу*/

let arr = [1, `hi`, false, 5, true, `ggg`];

/*- та вивести його в консоль*/
console.log(arr_number);
console.log(arr_string);
console.log(arr);

/*-- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль*/

let arr_0 = [];
arr_0[0] = 5;
arr_0[1] = true;
arr_0[2] = `hi`;
arr_0[3] = 6897;
arr_0[4] = `hello`;
arr_0[5] = false;
console.log(arr_0);

/*- є масив [2,17,13,6,22,31,45,66,100,-18] :
1. перебрати його циклом while*/

let array = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
let i = 0;
while (i < array.length) {
    console.log(array[i]);
    i++;
}

/*    2. перебрати його циклом for*/

for (let j = 0; j < array.length; j++) {
    console.log(array[j]);
}

/*    3. перебрати циклом while та вивести  числа тільки з непарним індексом*/

i = 0;
while (i < array.length) {
    if(i%2!==0){
    console.log(array[i]);}
    i++;
}

/*4. перебрати циклом for та вивести  числа тільки з непарним індексом*/

for (let j = 0; j < array.length; j++) {
    if(j%2!==0){
    console.log(array[j]);}
}

/*5. перебрати циклом while та вивести  числа тільки парні  значення*/

i = 0;
while (i < array.length) {
    if(array[i]%2===0){
        console.log(array[i]);}
    i++;
}

/*6. перебрати циклом for та вивести  числа тільки парні  значення*/

for (let j = 0; j < array.length; j++) {
    if(array[j]%2===0){
        console.log(array[j]);}
}

/*7. замінити кожне число кратне 3 на слово "okten"*/

let array1 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

for (let j = 0; j < array1.length; j++) {
    if(array1[j]%3===0){
        array1[j]=`okten`;}
}
console.log(array1);

/*8. вивести масив в зворотньому порядку.*/

for (let j = array.length - 1; j >= 0; j--) {
    console.log(array[j]);
}


/*9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)*/
let array3 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
console.log(`-------------1-------------------------------`);
/*1revers--------------------------------------------------------------------------*/
i = array3.length-1;
while (i >= 0) {
    console.log(array3[i]);
    i--;
}
console.log(`------------2--------------------------------`);

/*2reverse--------------------------------------------------------------------------*/
for (let j = array3.length-1; j >= 0; j--) {
    console.log(array3[j]);
}
console.log(`---------------------3-----------------------`);

/*3reverse--------------------------------------------------------------------------*/
i = array3.length-1;
while (i >= 0) {
    if(i%2!==0){
        console.log(array3[i]);}
    i--;
}
console.log(`----------------4----------------------------`);

/*4reverse--------------------------------------------------------------------------*/
for (let j = array3.length-1; j >= 0; j--) {
    if(j%2!==0){
        console.log(array3[j]);}
}
console.log(`--------------5------------------------------`);

/*5reverse--------------------------------------------------------------------------*/
i = array3.length-1;
while (i >=0) {
    if(array3[i]%2===0){
        console.log(array3[i]);}
    i--;
}
console.log(`----------------6----------------------------`);

/*6reverse--------------------------------------------------------------------------*/
for (let j = array3.length-1; j >=0; j--) {
    if(array3[j]%2===0){
        console.log(array3[j]);}
}
console.log(`-----------------7---------------------------`);

/*7reverse--------------------------------------------------------------------------*/
let array2 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

for (let j = array2.length-1; j >=0; j--) {
    if(array2[j]%3===0){
        array2[j]=`okten`;}
    console.log(array2[j]);
}
console.log(`--------------------------------------------`);

/*--------------------------------------------------------------------------*/




/*- Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
- Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
- Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
- Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи

- Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
- Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
- Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
- Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
- Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
- Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write


---------------------------------------------------------------------------------------------------------
стоврити масив книжок (назва, кількість сторінок, автори , жанри).*/


/*-знайти наібльшу книжку.
- знайти книжку/ки з найбільшою кількістю жанрів
- знайти книжку/ки з найдовшою назвою
- знайти книжку/ки які писали 2 автори
- знайти книжку/ки які писав 1 автор*/